OpenNuvoton/NuTool-PinConfigure/Header/NANO100BN/sys.h
/**************************************************************************//**
* @file     sys.h
* @version  V1.00
* $Revision: 17 $
* $Date: 15/06/24 1:11p $
* @brief    Nano100 Series system control header file.
*
* @note
* Copyright (C) 2013 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#ifndef __SYS_H__
#define __SYS_H__

#ifdef __cplusplus
extern "C"
{
#endif

/** @addtogroup NANO100_Device_Driver NANO100 Device Driver
  @{
*/

/** @addtogroup NANO100_SYS_Driver SYS Driver
  @{
*/

/** @addtogroup NANO100_SYS_EXPORTED_CONSTANTS SYS Exported Constants
  @{
*/

/*---------------------------------------------------------------------------------------------------------*/
/*  Module Reset Control Resister constant definitions.                                                    */
/*---------------------------------------------------------------------------------------------------------*/
#define CHIP_RST  ((0x0<<24) | SYS_IPRST_CTL1_CPU_RST_Pos   ) /*!< CPU reset is one of the SYS_ResetModule parameter */
#define CPU_RST   ((0x0<<24) | SYS_IPRST_CTL1_CHIP_RST_Pos  ) /*!< CHIP reset is one of the SYS_ResetModule parameter */
#define DMA_RST   ((0x0<<24) | SYS_IPRST_CTL1_DMA_RST_Pos   ) /*!< DMA reset is one of the SYS_ResetModule parameter */
#define EBI_RST   ((0x0<<24) | SYS_IPRST_CTL1_EBI_RST_Pos   ) /*!< EBI reset is one of the SYS_ResetModule parameter */
#define SC1_RST   ((0x4<<24) | SYS_IPRST_CTL2_SC1_RST_Pos   ) /*!< SmartCard1 reset is one of the SYS_ResetModule parameter */
#define SC0_RST   ((0x4<<24) | SYS_IPRST_CTL2_SC0_RST_Pos   ) /*!< SmartCard0 reset is one of the SYS_ResetModule parameter */
#define I2S_RST   ((0x4<<24) | SYS_IPRST_CTL2_I2S_RST_Pos   ) /*!< I2S reset is one of the SYS_ResetModule parameter */
#define ADC_RST   ((0x4<<24) | SYS_IPRST_CTL2_ADC_RST_Pos   ) /*!< ADC reset is one of the SYS_ResetModule parameter */
#define USBD_RST  ((0x4<<24) | SYS_IPRST_CTL2_USBD_RST_Pos  ) /*!< USBD reset is one of the SYS_ResetModule parameter */
#define DAC_RST   ((0x4<<24) | SYS_IPRST_CTL2_DAC_RST_Pos   ) /*!< DAC reset is one of the SYS_ResetModule parameter */
#define PWM1_RST  ((0x4<<24) | SYS_IPRST_CTL2_PWM1_RST_Pos  ) /*!< PWM1 reset is one of the SYS_ResetModule parameter */
#define PWM0_RST  ((0x4<<24) | SYS_IPRST_CTL2_PWM0_RST_Pos  ) /*!< PWM0 reset is one of the SYS_ResetModule parameter */
#define UART1_RST ((0x4<<24) | SYS_IPRST_CTL2_UART1_RST_Pos ) /*!< UART1 reset is one of the SYS_ResetModule parameter */
#define UART0_RST ((0x4<<24) | SYS_IPRST_CTL2_UART0_RST_Pos ) /*!< UART0 reset is one of the SYS_ResetModule parameter */
#define SPI2_RST  ((0x4<<24) | SYS_IPRST_CTL2_SPI2_RST_Pos  ) /*!< SPI2 reset is one of the SYS_ResetModule parameter */
#define SPI1_RST  ((0x4<<24) | SYS_IPRST_CTL2_SPI1_RST_Pos  ) /*!< SPI1 reset is one of the SYS_ResetModule parameter */
#define SPI0_RST  ((0x4<<24) | SYS_IPRST_CTL2_SPI0_RST_Pos  ) /*!< SPI0 reset is one of the SYS_ResetModule parameter */
#define I2C1_RST  ((0x4<<24) | SYS_IPRST_CTL2_I2C1_RST_Pos  ) /*!< I2C1 reset is one of the SYS_ResetModule parameter */
#define I2C0_RST  ((0x4<<24) | SYS_IPRST_CTL2_I2C0_RST_Pos  ) /*!< I2C0 reset is one of the SYS_ResetModule parameter */
#define TMR3_RST  ((0x4<<24) | SYS_IPRST_CTL2_TMR3_RST_Pos  ) /*!< Timer3 reset is one of the SYS_ResetModule parameter */
#define TMR2_RST  ((0x4<<24) | SYS_IPRST_CTL2_TMR2_RST_Pos  ) /*!< Timer2 reset is one of the SYS_ResetModule parameter */
#define TMR1_RST  ((0x4<<24) | SYS_IPRST_CTL2_TMR1_RST_Pos  ) /*!< Timer1 reset is one of the SYS_ResetModule parameter */
#define TMR0_RST  ((0x4<<24) | SYS_IPRST_CTL2_TMR0_RST_Pos  ) /*!< Timer0 reset is one of the SYS_ResetModule parameter */
#define GPIO_RST  ((0x4<<24) | SYS_IPRST_CTL2_GPIO_RST_Pos  ) /*!< GPIO reset is one of the SYS_ResetModule parameter */

/*---------------------------------------------------------------------------------------------------------*/
/*  Multi-Function constant definitions.                                                                   */
/*---------------------------------------------------------------------------------------------------------*/

/********************* Bit definition of VREFCTL register **********************/
#define SYS_VREFCTL_BGP_EN      SYS_VREFCTL_BGP_EN_Msk       /*!<Band-gap Enable */
#define SYS_VREFCTL_REG_EN      SYS_VREFCTL_REG_EN_Msk       /*!<Regulator Enable */
#define SYS_VREFCTL_SEL25       SYS_VREFCTL_SEL25_Msk        /*!<Regulator Output Voltage 2.5V */
#define SYS_VREFCTL_EXTMODE     SYS_VREFCTL_EXT_MODE_Msk     /*!<Regulator External Mode */

/********************* Bit definition of IRCTRIMCTL register **********************/
#define SYS_IRCTRIMCTL_TRIM_11_0592M (0x1UL<<SYS_IRCTRIMCTL_TRIM_SEL_Pos)      /*!<Trim HIRC to 11.0592 MHz */
#define SYS_IRCTRIMCTL_TRIM_12M      (0x2UL<<SYS_IRCTRIMCTL_TRIM_SEL_Pos)      /*!<Trim HIRC to 12 MHz */
#define SYS_IRCTRIMCTL_TRIM_12_288M  (0x3UL<<SYS_IRCTRIMCTL_TRIM_SEL_Pos)      /*!<Trim HIRC to 12.288 MHz */

#define SYS_IRCTRIMCTL_LOOP_4CLK     (0x0UL<<SYS_IRCTRIMCTL_TRIM_LOOP_Pos)     /*!<Based on average difference in 4 x 32.768 kHz clock */
#define SYS_IRCTRIMCTL_LOOP_8CLK     (0x1UL<<SYS_IRCTRIMCTL_TRIM_LOOP_Pos)     /*!<Based on average difference in 8 x 32.768 kHz clock */
#define SYS_IRCTRIMCTL_LOOP_16CLK    (0x2UL<<SYS_IRCTRIMCTL_TRIM_LOOP_Pos)     /*!<Based on average difference in 16 x 32.768 kHz clock */
#define SYS_IRCTRIMCTL_LOOP_32CLK    (0x3UL<<SYS_IRCTRIMCTL_TRIM_LOOP_Pos)     /*!<Based on average difference in 32 x 32.768 kHz clock */

#define SYS_IRCTRIMCTL_RETRY_64     (0x0UL<<SYS_IRCTRIMCTL_TRIM_RETRY_CNT_Pos) /*!<Trim retry count limitation is 64 */
#define SYS_IRCTRIMCTL_RETRY_128    (0x1UL<<SYS_IRCTRIMCTL_TRIM_RETRY_CNT_Pos) /*!<Trim retry count limitation is 128 */
#define SYS_IRCTRIMCTL_RETRY_256    (0x2UL<<SYS_IRCTRIMCTL_TRIM_RETRY_CNT_Pos) /*!<Trim retry count limitation is 256 */
#define SYS_IRCTRIMCTL_RETRY_512    (0x3UL<<SYS_IRCTRIMCTL_TRIM_RETRY_CNT_Pos) /*!<Trim retry count limitation is 512 */

/********************* Bit definition of IRCTRIMIEN register **********************/
#define SYS_IRCTRIMIEN_DISABLE      ((uint32_t)0x00000000)                /*!<Trim failure interrupt disable */
#define SYS_IRCTRIMIEN_FAIL_EN      SYS_IRCTRIMIEN_TRIM_FAIL_IEN_Msk      /*!<Trim failure interrupt enable */
#define SYS_IRCTRIMIEN_32KERR_EN    SYS_IRCTRIMIEN_32K_ERR_IEN_Msk        /*!<32.768 kHz Clock Error Interrupt Enable */

/********************* Bit definition of IRCTRIMINT register **********************/
#define SYS_IRCTRIMINT_FREQLOCK     SYS_IRCTRIMINT_FREQ_LOCK_Msk          /*!<HIRC frequency lock status */
#define SYS_IRCTRIMINT_FAIL_INT     SYS_IRCTRIMINT_TRIM_FAIL_INT_Msk      /*!<Trim failure interrupt status */
#define SYS_IRCTRIMINT_32KERR_INT   SYS_IRCTRIMINT_32K_ERR_INT_Msk        /*!<32.768 kHz Clock Error Interrupt Status */

